InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыОбработкиКодаМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВариантыОбработкиКодаМаркировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОткрытьФормуПроверкиИПодбора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьТоварВДокумент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ФормаВариантыОбработкиКодаМаркировки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ИмяНастройкиПользователей") Тогда 
		ИмяНастройкиПользователей = Параметры.ИмяНастройкиПользователей;
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяНастройкиПользователей) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			"ЗапомнитьВыбор", "Видимость", Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			"ГруппаИнформацияПоВыборуВариантаОбработки", "Видимость", Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьТовар(Команда)
	
	ВариантОбработкиКодаМаркировки = 
		ПредопределенноеЗначение("Перечисление.ВариантыОбработкиКодаМаркировки.ДобавитьТоварВДокумент");
	ОбработатьВыбор();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПроверкиИПодбора(Команда)
	
	ВариантОбработкиКодаМаркировки = 
		ПредопределенноеЗначение("Перечисление.ВариантыОбработкиКодаМаркировки.ОткрытьФормуПроверкиИПодбора");
	ОбработатьВыбор();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьВыбор()
	
	Если ЗапомнитьВыбор Тогда
		ЗаписатьНовуюНастройку();
	КонецЕсли;
	Закрыть(ВариантОбработкиКодаМаркировки);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНовуюНастройку()
	
	Пользователь = Пользователи.ТекущийПользователь();
	НастройкаПользователя = ПланыВидовХарактеристик.НастройкиПользователей[ИмяНастройкиПользователей];
	
	НаборЗаписей = РегистрыСведений.НастройкиПользователей.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Пользователь.Использование = Истина;
	НаборЗаписей.Отбор.Пользователь.Значение      = Пользователь;
	НаборЗаписей.Отбор.Настройка.Использование    = Истина;
	НаборЗаписей.Отбор.Настройка.Значение         = НастройкаПользователя;
	
	Запись = НаборЗаписей.Добавить();
	
	Запись.Пользователь = Пользователь;
	Запись.Настройка    = НастройкаПользователя;
	Запись.Значение = НастройкаПользователя.ТипЗначения.ПривестиЗначение(ВариантОбработкиКодаМаркировки);
	
	НаборЗаписей.Записать();
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти
